InformationRegisters/ПроцентыСевернойНадбавкиФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПроцентыСевернойНадбавкиФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПроцентыСевернойНадбавкиФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
		"РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьДействуетДоРегистраСведений() Экспорт
	
	ОбработкаЗавершена = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МаксимальнаяДата", ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата());
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроцентыСевернойНадбавкиФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛицаКОбработке
		|ИЗ
		|	РегистрСведений.ПроцентыСевернойНадбавкиФизическихЛиц КАК ПроцентыСевернойНадбавкиФизическихЛиц
		|ГДЕ
		|	ПроцентыСевернойНадбавкиФизическихЛиц.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФизическиеЛицаКОбработке.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТФизическиеЛицаКОбработке КАК ФизическиеЛицаКОбработке";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ОбработкаЗавершена = Ложь;
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПроцентыСевернойНадбавкиФизическихЛиц.Период КАК Период,
			|	ПроцентыСевернойНадбавкиФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ПроцентыСевернойНадбавкиФизическихЛиц.ПроцентСевернойНадбавки КАК ПроцентСевернойНадбавки
			|ПОМЕСТИТЬ ВТНаборыФизическихЛиц
			|ИЗ
			|	ВТФизическиеЛицаКОбработке КАК ФизическиеЛицаКОбработке
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентыСевернойНадбавкиФизическихЛиц КАК ПроцентыСевернойНадбавкиФизическихЛиц
			|		ПО ФизическиеЛицаКОбработке.ФизическоеЛицо = ПроцентыСевернойНадбавкиФизическихЛиц.ФизическоеЛицо
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НаборыФизическихЛиц.Период КАК Период,
			|	НаборыФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НаборыФизическихЛиц.ПроцентСевернойНадбавки КАК ПроцентСевернойНадбавки,
			|	МИНИМУМ(СледующиеПериоды.Период) КАК СледующийПериод
			|ПОМЕСТИТЬ ВТНаборыФизическихЛицСоСледующимиПериодами
			|ИЗ
			|	ВТНаборыФизическихЛиц КАК НаборыФизическихЛиц
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНаборыФизическихЛиц КАК СледующиеПериоды
			|		ПО НаборыФизическихЛиц.ФизическоеЛицо = СледующиеПериоды.ФизическоеЛицо
			|			И НаборыФизическихЛиц.Период < СледующиеПериоды.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	НаборыФизическихЛиц.Период,
			|	НаборыФизическихЛиц.ФизическоеЛицо,
			|	НаборыФизическихЛиц.ПроцентСевернойНадбавки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НаборыФизическихЛицСоСледующимиПериодами.Период КАК Период,
			|	НаборыФизическихЛицСоСледующимиПериодами.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НаборыФизическихЛицСоСледующимиПериодами.ПроцентСевернойНадбавки КАК ПроцентСевернойНадбавки,
			|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(НаборыФизическихЛицСоСледующимиПериодами.СледующийПериод, ДЕНЬ, -1), &МаксимальнаяДата) КАК ДействуетДо
			|ИЗ
			|	ВТНаборыФизическихЛицСоСледующимиПериодами КАК НаборыФизическихЛицСоСледующимиПериодами
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	Период";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("ФизическоеЛицо") Цикл
			
			НаборЗаписей = РегистрыСведений.ПроцентыСевернойНадбавкиФизическихЛиц.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
